{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\Daniel\Documents\MA_Econ\Causal_Inference\Replications\RDD\Do\Replication_1_Experiment.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 5 Mar 2021, 23:07:37
{txt}
{com}. //_1
. display c(current_date)
{res} 5 Mar 2021
{txt}
{com}. //_2
. use https://github.com/scunning1975/causal-inference-class/raw/master/hansen_dwi, clear
{txt}
{com}. //_3
. gen bac_dummy = (bac1 >= 0.08)
{txt}
{com}. //_4
. quietly hist bac1, width(0.001000001) xline(0.08) xtitle("BAC") title("Histogram of Blood Alchol Content")
{txt}
{com}. //_5
. quietly rddensity bac1, c(0.08) kernel(uniform)
{txt}
{com}. di e(pv_q)
{res}.92521283
{txt}
{com}. //_6
. quietly graph export ".\Figures\pic1.png", width(800) replace
{txt}
{com}. //_7
. quietly rdrobust male bac1, c(0.08) h(0.05) kernel(uniform)
{txt}
{com}. eststo
{txt}({res}est1{txt} stored)

{com}. quietly rdrobust white bac1, c(0.08) h(0.05) kernel(uniform)
{txt}
{com}. eststo
{txt}({res}est2{txt} stored)

{com}. quietly rdrobust aged bac1, c(0.08) h(0.05) kernel(uniform)
{txt}
{com}. eststo
{txt}({res}est3{txt} stored)

{com}. quietly rdrobust acc bac1, c(0.08) h(0.05) kernel(uniform)
{txt}
{com}. eststo
{txt}({res}est4{txt} stored)

{com}. esttab using ".\Tables\table1.tex", se("%g") label title("Covariate Balance") mtitles("Male" "White" "Age" "Accident") replace rename(RD_Estimate DUI)
{res}{txt}(output written to {browse  `".\Tables\table1.tex"'})

{com}. eststo clear
{txt}
{com}. //_8
. quietly cmogram acc bac1 if bac1 <= 0.2 & bac1 >= 0.04, scatter cutpoint(0.08) lfitci lineat(0.08) graphopts(xtitle("BAC") title("Accident at scene"))
{txt}
{com}. quietly graph export ".\Figures\pic3.png", width(800) replace
{txt}
{com}. quietly cmogram male bac1 if bac1 <= 0.2 & bac1 >= 0.04, scatter cutpoint(0.08) lfitci lineat(0.08) graphopts(xtitle("BAC") title("Male"))
{txt}
{com}. quietly graph export ".\Figures\pic4.png", width(800) replace
{txt}
{com}. quietly cmogram aged bac1 if bac1 <= 0.2 & bac1 >= 0.04, scatter cutpoint(0.08) lfitci lineat(0.08) graphopts(xtitle("BAC") title("Age"))
{txt}
{com}. quietly graph export ".\Figures\pic5.png", width(800) replace
{txt}
{com}. quietly cmogram white bac1 if bac1 <= 0.2 & bac1 >= 0.04, scatter cutpoint(0.08) lfitci lineat(0.08) graphopts(xtitle("BAC") title("White"))
{txt}
{com}. quietly graph export ".\Figures\pic6.png", width(800) replace
{txt}
{com}. //_9
. quietly cmogram acc bac1 if bac1 <= 0.2 & bac1 >= 0.04, scatter cutpoint(0.08) qfitci lineat(0.08) graphopts(xtitle("BAC") title("Accident at scene"))
{txt}
{com}. quietly graph export ".\Figures\pic7.png", width(800) replace
{txt}
{com}. quietly cmogram male bac1 if bac1 <= 0.2 & bac1 >= 0.04, scatter cutpoint(0.08) qfitci lineat(0.08) graphopts(xtitle("BAC") title("Male"))
{txt}
{com}. quietly graph export ".\Figures\pic8.png", width(800) replace
{txt}
{com}. quietly cmogram aged bac1 if bac1 <= 0.2 & bac1 >= 0.04, scatter cutpoint(0.08) qfitci lineat(0.08) graphopts(xtitle("BAC") title("Age"))
{txt}
{com}. quietly graph export ".\Figures\pic9.png", width(800) replace
{txt}
{com}. quietly cmogram white bac1 if bac1 <= 0.2 & bac1 >= 0.04, scatter cutpoint(0.08) qfitci lineat(0.08) graphopts(xtitle("BAC") title("White"))
{txt}
{com}. quietly graph export ".\Figures\pic10.png", width(800) replace
{txt}
{com}. //_10
. quietly gen bac_sq = bac1 * bac1
{txt}
{com}. quietly gen bac_inter = bac1* bac_dummy
{txt}
{com}. quietly gen bac_inter_sq = bac1 * bac1 * bac_dummy
{txt}
{com}. //_11
. quietly rdrobust recidivism bac1 if bac1 >= 0.03 & bac1 <= 0.13, c(0.08) h(0.05) kernel(uniform) covs(bac1) all
{txt}
{com}. eststo
{txt}({res}est1{txt} stored)

{com}. quietly rdrobust recidivism bac1 if bac1 >= 0.03 & bac1 <= 0.13, c(0.08) h(0.05) kernel(uniform) covs(bac1     bac_dummy bac_inter) all
{txt}
{com}. eststo
{txt}({res}est2{txt} stored)

{com}. quietly rdrobust recidivism bac1 if bac1 >= 0.03 & bac1 <= 0.13, c(0.08) h(0.05) kernel(uniform) covs(bac1 bac_dummy bac_inter bac_sq bac_inter_sq) all
{txt}
{com}. eststo
{txt}({res}est3{txt} stored)

{com}. //_12
. esttab using ".\Tables\table2.tex", se("%g") label title("Panel A: Recidivism Local Linear Regression") mtitles("BAC control" "Linear interaction" "Linear, quad. interactions") replace drop(Conventional Bias*)
{res}{txt}(output written to {browse  `".\Tables\table2.tex"'})

{com}. eststo clear
{txt}
{com}. //_13
. quietly rdrobust recidivism bac1 if bac1 >= 0.055 & bac1 <= 0.105, c(0.08) h(0.05) kernel(uniform) covs(bac1) all
{txt}
{com}. eststo
{txt}({res}est1{txt} stored)

{com}. quietly rdrobust recidivism bac1 if bac1 >= 0.055 & bac1 <= 0.105, c(0.08) h(0.05) kernel(uniform) covs(bac1     bac_dummy bac_inter) all
{txt}
{com}. eststo
{txt}({res}est2{txt} stored)

{com}. quietly rdrobust recidivism bac1 if bac1 >= 0.055 & bac1 <= 0.105, c(0.08) h(0.05) kernel(uniform) covs(bac1 bac_dummy bac_inter bac_sq bac_inter_sq) all
{txt}
{com}. eststo
{txt}({res}est3{txt} stored)

{com}. //_14
. esttab using ".\Tables\table3.tex", se("%g") label title("Panel B: Recidivism Local Linear Regression") mtitles("BAC control" "Linear interaction" "Linear, quad. interactions") replace drop(Conventional Bias*)  rename(Robust DUI) gaps 
{res}{txt}(output written to {browse  `".\Tables\table3.tex"'})

{com}. eststo clear
{txt}
{com}. //_15
. quietly cmogram recidivism bac1 if bac1 <= 0.15, scatter cutpoint(0.08) lfitci lineat(0.08) graphopts(xtitle("BAC") title("Recidivism against BAC, linear fit"))
{txt}
{com}. quietly graph export ".\Figures\pic11.png", width(800) replace
{txt}
{com}. //_16
. quietly cmogram recidivism bac1 if bac1 <= 0.15, scatter cutpoint(0.08) qfitci lineat(0.08) graphopts(xtitle("BAC") title("Recidivism against BAC, quadratic fit"))
{txt}
{com}. quietly graph export ".\Figures\pic12.png", width(800) replace
{txt}
{com}. //_17
. cd "C:\Users\Daniel\Documents\MA_Econ\Causal_Inference\Replications\RDD\Do\"
{res}C:\Users\Daniel\Documents\MA_Econ\Causal_Inference\Replications\RDD\Do
{txt}
{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\Daniel\Documents\MA_Econ\Causal_Inference\Replications\RDD\Do\Replication_1_Experiment.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 5 Mar 2021, 23:08:44
{txt}{.-}
{smcl}
{txt}{sf}{ul off}