{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\Daniel\Documents\MA_Econ\Causal_Inference\Replications\RDD\Do\Replication_1_Experiment.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 5 Mar 2021, 13:09:33
{txt}
{com}. //_1
. display c(current_date)
{res} 5 Mar 2021
{txt}
{com}. //_2
. use https://github.com/scunning1975/causal-inference-class/raw/master/hansen_dwi, clear
{txt}
{com}. //_3
. gen bac_dummy = (bac1 >= 0.08)
{txt}
{com}. //_4
. quietly hist bac1, width(0.001000001)
{txt}
{com}. //_5
. rddensity bac1, c(0.08) kernel(uniform)
{res}Computing data-driven bandwidth selectors.

Point estimates and standard errors have been adjusted for repeated observations.
(Use option {it:nomasspoints} to suppress this adjustment.)

RD Manipulation test using local polynomial density estimation.

{txt}{ralign 9: c = }{res}    0.080{col 19} {c |}{col 22}{txt}Left of c{col 33}Right of c{col 53}Number of obs = {res}      214558
{txt}{hline 19}{c +}{hline 22}{col 53}Model         = {res}{ralign 12:unrestricted}
{txt}{ralign 18:Number of obs}{col 19} {c |} {col 21}{res}    23010{col 34}   191548{col 53}{txt}BW method     = {res}{ralign 12:comb}
{txt}{ralign 18:Eff. Number of obs}{col 19} {c |} {col 21}{res}    14727{col 34}    28946{col 53}{txt}Kernel        = {res}{ralign 12:uniform}
{txt}{ralign 18:Order est. (p)}{col 19} {c |} {col 21}{res}        2{col 34}        2{col 53}{txt}VCE method    = {res}{ralign 12:jackknife}
{txt}{ralign 18:Order bias (q)}{col 19} {c |} {col 21}{res}        3{col 34}        3
{txt}{ralign 18:BW est. (h)}{col 19} {c |} {col 21}{res}    0.023{col 34}    0.023

Running variable: bac1.
{txt}{hline 19}{c TT}{hline 22}
{ralign 18:Method}{col 19} {c |} {col 23}    T{col 38}P>|T|
{hline 19}{c +}{hline 22}
{ralign 18:Robust}{col 19} {c |} {col 21}{res}  -0.0939{col 34}   0.9252
{txt}{hline 19}{c BT}{hline 22}

{res}P-values of binomial tests.{txt} (H0: prob = .5)
{hline 19}{c TT}{hline 22}{c TT}{hline 10}
{ralign 18: Window Length / 2}{col 20}{c |}{ralign 9: <c}{col 33}{ralign 9: >=c}{col 43}{c |}{col 49}P>|T|
{hline 19}{c +}{hline 22}{c +}{hline 10}
{res}{col 10}    0.000{col 20}{c |}      909{col 33}        0{col 43}{c |}{col 45}   0.0000
{col 10}    0.000{col 20}{c |}      909{col 33}        0{col 43}{c |}{col 45}   0.0000
{col 10}    0.000{col 20}{c |}      909{col 33}        0{col 43}{c |}{col 45}   0.0000
{col 10}    0.000{col 20}{c |}      909{col 33}        0{col 43}{c |}{col 45}   0.0000
{col 10}    0.000{col 20}{c |}      909{col 33}        0{col 43}{c |}{col 45}   0.0000
{col 10}    0.000{col 20}{c |}      909{col 33}        0{col 43}{c |}{col 45}   0.0000
{col 10}    0.000{col 20}{c |}      909{col 33}        0{col 43}{c |}{col 45}   0.0000
{col 10}    0.000{col 20}{c |}      909{col 33}        0{col 43}{c |}{col 45}   0.0000
{col 10}    0.000{col 20}{c |}      909{col 33}        0{col 43}{c |}{col 45}   0.0000
{col 10}    0.000{col 20}{c |}      909{col 33}        0{col 43}{c |}{col 45}   0.0000
{txt}{hline 19}{c BT}{hline 22}{c BT}{hline 10}
{res}{txt}
{com}. quietly graph export ".\Figures\pic1.png", width(500) replace
{txt}
{com}. //_6
. quietly rdrobust male bac1, c(0.08) h(0.05) kernel(uniform)
{txt}
{com}. eststo
{txt}({res}est1{txt} stored)

{com}. quietly rdrobust white bac1, c(0.08) h(0.05) kernel(uniform)
{txt}
{com}. eststo
{txt}({res}est2{txt} stored)

{com}. quietly rdrobust aged bac1, c(0.08) h(0.05) kernel(uniform)
{txt}
{com}. eststo
{txt}({res}est3{txt} stored)

{com}. quietly rdrobust acc bac1, c(0.08) h(0.05) kernel(uniform)
{txt}
{com}. eststo
{txt}({res}est4{txt} stored)

{com}. esttab using ".\Tables\table1.tex", se("%g") label title("Covariate Balance") mtitles("Male" "White" "Age" "Accident") replace rename(RD_Estimate DUI)
{res}{txt}(output written to {browse  `".\Tables\table1.tex"'})

{com}. eststo clear
{txt}
{com}. //_7
. quietly cmogram acc bac1, scatter cutpoint(0.08)
{txt}
{com}. quietly graph export ".\Figures\pic2.png", width(500) replace
{txt}
{com}. //_8
. quietly cmogram acc bac1 if bac1 <= 0.2 & bac1 >= 0.04, scatter cutpoint(0.08) lfitci lineat(0.08)
{txt}
{com}. quietly graph export ".\Figures\pic3.png", width(500) replace
{txt}
{com}. quietly cmogram male bac1 if bac1 <= 0.2 & bac1 >= 0.04, scatter cutpoint(0.08) lfitci lineat(0.08)
{txt}
{com}. quietly graph export ".\Figures\pic4.png", width(500) replace
{txt}
{com}. quietly cmogram aged bac1 if bac1 <= 0.2 & bac1 >= 0.04, scatter cutpoint(0.08) lfitci lineat(0.08)
{txt}
{com}. quietly graph export ".\Figures\pic5.png", width(500) replace
{txt}
{com}. quietly cmogram white bac1 if bac1 <= 0.2 & bac1 >= 0.04, scatter cutpoint(0.08) lfitci lineat(0.08)
{txt}
{com}. quietly graph export ".\Figures\pic6.png", width(500) replace
{txt}
{com}. //_9
. quietly cmogram acc bac1 if bac1 <= 0.2 & bac1 >= 0.04, scatter cutpoint(0.08) qfitci lineat(0.08)
{txt}
{com}. quietly graph export ".\Figures\pic7.png", width(500) replace
{txt}
{com}. quietly cmogram male bac1 if bac1 <= 0.2 & bac1 >= 0.04, scatter cutpoint(0.08) qfitci lineat(0.08)
{txt}
{com}. quietly graph export ".\Figures\pic8.png", width(500) replace
{txt}
{com}. quietly cmogram aged bac1 if bac1 <= 0.2 & bac1 >= 0.04, scatter cutpoint(0.08) qfitci lineat(0.08)
{txt}
{com}. quietly graph export ".\Figures\pic9.png", width(500) replace
{txt}
{com}. quietly cmogram white bac1 if bac1 <= 0.2 & bac1 >= 0.04, scatter cutpoint(0.08) qfitci lineat(0.08)
{txt}
{com}. quietly graph export ".\Figures\pic10.png", width(500) replace
{txt}
{com}. //_10
. quietly gen bac_sq = bac1 * bac1
{txt}
{com}. quietly gen bac_inter = bac1* bac_dummy
{txt}
{com}. quietly gen bac_inter_sq = bac1 * bac1 * bac_dummy
{txt}
{com}. //_11
. quietly rdrobust recidivism bac1 if bac1 >= 0.03 & bac1 <= 0.13, c(0.08) h(0.05) kernel(uniform) covs(bac1) all
{txt}
{com}. eststo
{txt}({res}est1{txt} stored)

{com}. quietly rdrobust recidivism bac1 if bac1 >= 0.03 & bac1 <= 0.13, c(0.08) h(0.05) kernel(uniform) covs(bac1     bac_dummy bac_inter) all
{txt}
{com}. eststo
{txt}({res}est2{txt} stored)

{com}. quietly rdrobust recidivism bac1 if bac1 >= 0.03 & bac1 <= 0.13, c(0.08) h(0.05) kernel(uniform) covs(bac1 bac_dummy bac_inter bac_sq bac_inter_sq) all
{txt}
{com}. eststo
{txt}({res}est3{txt} stored)

{com}. //_12
. esttab using ".\Tables\table2.tex", se("%g") label title("Panel A: Recidivism Local Linear Regression") mtitles("BAC control" "Linear interaction" "Linear, quad. interactions") replace drop(Conventional Bias*)
{res}{txt}(output written to {browse  `".\Tables\table2.tex"'})

{com}. eststo clear
{txt}
{com}. //_13
. quietly rdrobust recidivism bac1 if bac1 >= 0.055 & bac1 <= 0.105, c(0.08) h(0.05) kernel(uniform) covs(bac1) all
{txt}
{com}. eststo
{txt}({res}est1{txt} stored)

{com}. quietly rdrobust recidivism bac1 if bac1 >= 0.055 & bac1 <= 0.105, c(0.08) h(0.05) kernel(uniform) covs(bac1     bac_dummy bac_inter) all
{txt}
{com}. eststo
{txt}({res}est2{txt} stored)

{com}. quietly rdrobust recidivism bac1 if bac1 >= 0.055 & bac1 <= 0.105, c(0.08) h(0.05) kernel(uniform) covs(bac1 bac_dummy bac_inter bac_sq bac_inter_sq) all
{txt}
{com}. eststo
{txt}({res}est3{txt} stored)

{com}. //_14
. esttab using ".\Tables\table3.tex", se("%g") label title("Panel B: Recidivism Local Linear Regression") mtitles("BAC control" "Linear interaction" "Linear, quad. interactions") replace drop(Conventional Bias*)
{res}{txt}(output written to {browse  `".\Tables\table3.tex"'})

{com}. eststo clear
{txt}
{com}. //_15
. quietly cmogram recidivism bac1 if bac1 <= 0.15, scatter cutpoint(0.08) lfitci lineat(0.08)
{txt}
{com}. quietly graph export ".\Figures\pic11.png", width(500) replace
{txt}
{com}. //_16
. quietly cmogram recidivism bac1 if bac1 <= 0.15, scatter cutpoint(0.08) qfitci lineat(0.08)
{txt}
{com}. quietly graph export ".\Figures\pic12.png", width(500) replace
{txt}
{com}. //_17
. cd "C:\Users\Daniel\Documents\MA_Econ\Causal_Inference\Replications\RDD\Do\"
{res}C:\Users\Daniel\Documents\MA_Econ\Causal_Inference\Replications\RDD\Do
{txt}
{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\Daniel\Documents\MA_Econ\Causal_Inference\Replications\RDD\Do\Replication_1_Experiment.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 5 Mar 2021, 13:10:43
{txt}{.-}
{smcl}
{txt}{sf}{ul off}